CheatSheet.org
* Header                                                             :ignore:
  :PROPERTIES:
  :CUSTOM_ID: Header
  :END:
#+TITLE: Vue.js CheatSheet
# +SUBTITLE: ---Reference Sheet for “What I'm Currently Learning”---
#+MACRO: blurb A reference for the accessible JS framework that gives HTML: {{Variables}}, Conditionals, Loops, etc!
#+AUTHOR: [[https://alhassy.github.io/][Musa Al-hassy]]
#+EMAIL: alhassy@gmail.com
# +TODO: Todo | spacing LaTeX
#+INCLUDE: ~/CheatSheet/CheatSheetSetup.org
# +OPTIONS: broken-links:auto toc:nil
# let's always break newlines, with a ‘↪’ indicated new lines.
#+LaTeX: \setminted[html]{fontsize=\footnotesize, breaklines}
#+EXPORT_FILE_NAME: index.html
# blog:header
#+TOC: headlines 2

* Hello World!
  :PROPERTIES:
  :CUSTOM_ID: Hello-World
  :END:

#+HTML_HEAD: <link href="https://alhassy.github.io/org-notes-style.css" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="https://alhassy.github.io/floating-toc.css" rel="stylesheet" type="text/css" />


# AngularJS is a JavaScript framework that operates on the client side and is used
# to develop web applications.  Web development is one of the most preferred and
# cost-effective ways to create distributed applications.  The deployment done
# once on one machine can be made accessible to all the users on the world wide
# web.

  Vue.js enhances HTML by giving it a /dynamic/ layer; i.e., raw HTML just
  displays things, but with Vue.js we can have parts shown according to, say,
  input boxes and variables (which raw HTML does not have).
  [See also the [[https://alhassy.github.io/JavaScriptCheatSheet/CheatSheet.pdf][JavaScriptCheatSheet]] PDF.]

  # jQuery is a more verbose alternative.

  /An example is worth a thousand words!/
  #+begin_src html :tangle del/index.html
<html >
  <!-- ⟨0⟩ Actually load Vue.js -->
  <script src="https://unpkg.com/vue@3"></script>
  <body>
      <div id="hello">  <!-- ⟨1⟩ Vue.js is active for this div; see ⟨4⟩ -->

          <!-- ⟨2⟩ The *value* of this text box is named “yourName” -->
          <input v-model="yourName" placeholder="Enter a name here">

          <!-- ⟨3⟩ Actually use the “yourName” value here,
               *whenever* it is updated! -->
          <h1>Hello {{yourName.toUpperCase()}}!</h1>
      </div>

      <!-- ⟨4⟩ Setup the associated model for “#hello” -->
      <script>
       let myApp = Vue.createApp({
           data() {
               return {
                   yourName: 'Jason'
               }
           }
       }).mount('#hello')

       // Here, we can perform complex logic (JS code) on “myApp.yourName”.
       // Vue.js automatically keeps the HTML view and the JS model in sync.
       myApp.yourName = 'Jasim'
      </script>
  </body>
</html>
#+end_src

This is a /self-contained/ *interactive* program: Whenever the input box's value is
changed then so is the greeting header “Hello ...!”.

Bindings like ~{{this}}~ are known as /[[https://github.com/janl/mustache.js#templates][mustache]] tags, which tell Vue.js that it
should evaluate an [[https://docs.angularjs.org/guide/expression][expression]]/ and insert the result into the DOM in place of
the binding. Rather than a one-time insert, a binding will result in efficient
continuous updates whenever the result of the expression evaluation changes.

Finally, Vue.js is /reactive/: If you open your browser's console, and evaluate
~myApp.yourName = 'Bob'~, then the HTML view changes!

/Exercise!/ Using ~<input type="number" ...>~, make a super simple site with two
input boxes for numbers and a header that shows their sum whenever a user inputs
values. (/Hint!/ Use ~Number(x)~ to convert a string ~x~ to a number.)

#+latex: \columnbreak

+ A page can be associated with multiple Vue.js apps, and
  the ~id~-dentifier attribute specifies which HTML element
  views an app.

