index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-23 Wed 09:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vue.js CheatSheet</title>
<meta name="author" content="[[https://alhassy.github.io/][Musa Al-hassy]]" />
<meta name="generator" content="Org Mode" />
<link href="https://alhassy.github.io/org-notes-style.css" rel="stylesheet" type="text/css" />
<link href="https://alhassy.github.io/floating-toc.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Vue.js CheatSheet</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#Hello-World">1. <a href="#Hello-World">Hello World!</a></a></li>
<li><a href="#Vue-js-makes-HTML-into-a-language-with-variables-and-control-flow">2. <a href="#Vue-js-makes-HTML-into-a-language-with-variables-and-control-flow">Vue.js makes HTML into a language with variables and control flow</a></a></li>
</ul>
</div>
</div>















<div id="outline-container-Hello-World" class="outline-2">
<h2 id="Hello-World"><span class="section-number-2">1.</span> <a href="#Hello-World">Hello World!</a></h2>
<div class="outline-text-2" id="text-Hello-World">
<p>
Vue.js enhances HTML by giving it a <i>dynamic</i> layer; i.e., raw HTML just
displays things, but with Vue.js we can have parts shown according to, say,
input boxes and variables (which raw HTML does not have).
[See also the <a href="https://alhassy.github.io/JavaScriptCheatSheet/CheatSheet.pdf">JavaScriptCheatSheet</a> PDF.]
</p>

<p>
<i>An example is worth a thousand words!</i>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #b58900;">html</span> &gt;
  <span style="color: #96A7A9; font-style: italic;">&lt;!-- </span><span style="color: #96A7A9; font-style: italic;">&#10216;0&#10217; Actually load Vue.js </span><span style="color: #96A7A9; font-style: italic;">--&gt;</span>
  &lt;<span style="color: #b58900;">script</span> <span style="color: #268bd2;">src</span>=<span style="color: #2aa198;">"https://unpkg.com/vue@3"</span>&gt;&lt;/<span style="color: #b58900;">script</span>&gt;
  &lt;<span style="color: #b58900;">body</span>&gt;
      &lt;<span style="color: #b58900;">div</span> <span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"hello"</span>&gt;  <span style="color: #96A7A9; font-style: italic;">&lt;!-- </span><span style="color: #96A7A9; font-style: italic;">&#10216;1&#10217; Vue.js is active for this div; see &#10216;4&#10217; </span><span style="color: #96A7A9; font-style: italic;">--&gt;</span>

          <span style="color: #96A7A9; font-style: italic;">&lt;!-- </span><span style="color: #96A7A9; font-style: italic;">&#10216;2&#10217; The *value* of this text box </span><span style="color: #96A7A9; font-style: italic; text-decoration: underline;">is named</span><span style="color: #96A7A9; font-style: italic;"> &#8220;yourName&#8221; </span><span style="color: #96A7A9; font-style: italic;">--&gt;</span>
          &lt;<span style="color: #b58900;">input</span> <span style="color: #268bd2;">v-model</span>=<span style="color: #2aa198;">"yourName"</span> <span style="color: #268bd2;">placeholder</span>=<span style="color: #2aa198;">"Enter a name here"</span>&gt;

          <span style="color: #96A7A9; font-style: italic;">&lt;!-- </span><span style="color: #96A7A9; font-style: italic;">&#10216;3&#10217; Actually use the &#8220;yourName&#8221; value here,</span>
<span style="color: #96A7A9; font-style: italic;">               *whenever* it </span><span style="color: #96A7A9; font-style: italic; text-decoration: underline;">is updated</span><span style="color: #96A7A9; font-style: italic;">! </span><span style="color: #96A7A9; font-style: italic;">--&gt;</span>
          &lt;<span style="color: #b58900;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Hello {{yourName.toUpperCase()}}!</span>&lt;/<span style="color: #b58900;">h1</span>&gt;
      &lt;/<span style="color: #b58900;">div</span>&gt;

      <span style="color: #96A7A9; font-style: italic;">&lt;!-- </span><span style="color: #96A7A9; font-style: italic;">&#10216;4&#10217; Setup the associated model for &#8220;#hello&#8221; </span><span style="color: #96A7A9; font-style: italic;">--&gt;</span>
      &lt;<span style="color: #b58900;">script</span>&gt;
       let myApp = Vue.createApp({
           data() {
               return {
                   yourName: 'Jason'
               }
           }
       }).mount('#hello')

       // Here, we can perform complex logic (JS code) on &#8220;myApp.yourName&#8221;.
       // Vue.js automatically keeps the HTML view and the JS model in sync.
       myApp.yourName = 'Jasim'
      &lt;/<span style="color: #b58900;">script</span>&gt;
  &lt;/<span style="color: #b58900;">body</span>&gt;
&lt;/<span style="color: #b58900;">html</span>&gt;
</pre>
</div>

<p>
This is a <i>self-contained</i> <b>interactive</b> program: Whenever the input box's value is
changed then so is the greeting header “Hello &#x2026;!”.
</p>

<p>
Bindings like <code>{{this}}</code> are known as <i><a href="https://github.com/janl/mustache.js#templates">mustache</a> tags, which tell Vue.js that it
should evaluate an <a href="https://docs.angularjs.org/guide/expression">expression</a></i> and insert the result into the DOM in place of
the binding. Rather than a one-time insert, a binding will result in efficient
continuous updates whenever the result of the expression evaluation changes.
</p>

<p>
Finally, Vue.js is <i>reactive</i>: If you open your browser's console, and evaluate
<code>myApp.yourName = 'Bob'</code>, then the HTML view changes!
</p>

<p>
<i>Exercise!</i> Using <code>&lt;input type="number" ...&gt;</code>, make a super simple site with two
input boxes for numbers and a header that shows their sum whenever a user inputs
values. (<i>Hint!</i> Use <code>Number(x)</code> to convert a string <code>x</code> to a number.)
</p>

<ul class="org-ul">
<li>A page can be associated with multiple Vue.js apps, and
the <code>id</code>-dentifier attribute specifies which HTML element
views an app.</li>
</ul>
</div>
</div>
